#include "stdafx.h"
/******************************************************************* 
 *  Copyright(c) 2000-2013 Company Name 
 *  All rights reserved. 
 *   
 *  文件名称: Description.cpp
 *  简要描述: 
 *   
 *  创建日期: 2016/04/28
 *  作者: xiaoge
 *  说明: 
 *   
 *  修改记录: 
 xiaoge		1.0.128.1604	2016/04/28 09:18	1.创建日志库
 xiaoge		1.0.228.1604	2016/04/28 17:27	1.修改写日志为工厂模式
 xiaoge		1.0.316.1605	2016/05/16 16:07	1.修改日志能打印正确的文件名和行号
 xiaoge		1.0.431.1605    2016/05/31 11:27	1.修改程序关闭以后会有少部分日志没有打印的现象，添加了CloseLogger接口的调用。
 yanshiqi	1.0.505.1609    2016/05/31 11:27	1._vsnprintf函数没用好，导致内存越界，字符串"\0"要占一位。
 xiaoge		1.0.617.1701	2017/01/17 14:33	1.添加自动删除日志的功能。
 xiaoge		1.0.717.1701	2017/01/17 15:023	1.修改 nSaveTotalTime 会越界导致的保存时间错误的问题。
 ******************************************************************/  